const Template = () => {
  return (
    <div>
      <p>Participle - причастие</p>
      <p>
        Причастие - это типо прилагательного образованного от глагола (решенная
        задача - от глагола решать) и напротив (красивая задача - нет глагола,
        просто прилагательное)
      </p>
      <p>
        Все правильные глаголы образуются путем (V1 + ed = V2 = V3), они нужны
        исключительно для прошедшего времени, а вот для неправильных глаголов
        эта формула не подойдет, у них свои уникальные формы которые нужно
        заучивать. (V2 не всегда = V3) для неправильных глаголов
      </p>
      <p>
        work - правильный глагол т.к worked <br />
        buy - bought, неправильный глагол
      </p>
      <br />
      <p>Формы глагола</p>
      <p>Всего их 5</p>
      <p>1.(V1 = Verb Form 1) Базовая - основа</p>
      <br />
      <br />
      <p>V2 - Past simple</p>
      <p>
        V3 - Past Perfect(Participle) и в (Passive Voice - разобраться позже)
      </p>

      <p>4. основа + s, для обозначение другого лица: He work(s) from home</p>
      <p>
        5. основа + ing, для обозначения продолжительности: He is working at the
        moment(Present Participle / Gerund) particile - работающий
      </p>
      <p>
        4 и 5 формы нет, поскольку таблица нужна именно для неправильных
        глаголов которые нужно заучивать, эти же неправильные глаголы в 4 и 5
        формах формируется обычным образом и иной формы которую нужно заучивать
        нет, по этому всего 3 формы в таблице
      </p>
      <br />
      <br />
      <p>28.07.26</p>
      <p>
        Past Simple - это наиболее часто используемая форма <br />
        просто (Verb + ed или V2) <br />
        Однако форма меняется если это пассивный залог
      </p>
      <p>
        И напротив, если мы видим какую то другую форму, значит акцент делается
        на прошлое относительно какого то события в прошлом либо это пассивный
        залог
      </p>
      <br />
      <br />
      <p>
        Только в Present Simple, базовая форма (to have) для (he/she/it)
        становится has. (от старого англ) work - works, have - haves (cократили
        до has), то же самое и для многих других по такому типу, напримео do -
        does(должно было dos, но не понравилось)
      </p>
      <br />
      <p>
        have может быть сомостоятельным словом которое переводится как иметь.
        eg: I have a car. <br />
        Так же have может быть вспомогательным словом для для другого глагола.
        eg: I have finished the work.
      </p>
      <br />
      <p>
        Формы глагола: to be: (am, is, are, was, were, been, being, will be)
      </p>
      <p>am / is / are = present</p>
      <p>be - infinitive</p>
      <p>was / were = V2 = внутреннее свойство past = true</p>
      <p>been = V3 = внутреннее свойство completed = true</p>
      <p>
        I / He / She / It - was <br />
        You / We / They - were
      </p>
      <p>
        НЕЛЬЗЯ! сказать что то типа: I was been, поскольку was и been это один и
        тот же глагол в разных формах
      </p>
      <p>
        have - тоже меняет свои формы в зависимости от времени ( have / has /
        had / having )
      </p>
      <p>в прошедшем времени для всех местоимений становится had</p>
      <p>
        другие глаголы: <br />
        Настоящее work / works <br />
        <p>
          I work <br />
          You work <br />
          We work <br />
          They work <br />
          He works <br />
        </p>
        Прошедшее worked <br />
        Будущее will work
      </p>
    </div>
  );
};
